package utils_test

import (
	"testing"

	"github.com/chayakorn2002/thb-amount-to-text-go/utils"
	"github.com/shopspring/decimal"
)

func TestDecimalToBahtText(t *testing.T) {
	tests := map[string]string{
		// Zero & leading
		"0":       "ศูนย์บาทถ้วน",
		"0.0":     "ศูนย์บาทถ้วน",
		"0000":    "ศูนย์บาทถ้วน",
		"0001":    "หนึ่งบาทถ้วน",
		"0000.50": "ห้าสิบสตางค์",

		// Satang only
		"0.01": "หนึ่งสตางค์",
		"0.04": "สี่สตางค์",
		"0.05": "ห้าสตางค์",
		"0.10": "สิบสตางค์",
		"0.25": "ยี่สิบห้าสตางค์",
		"0.50": "ห้าสิบสตางค์",
		"0.99": "เก้าสิบเก้าสตางค์",

		// Round up/down
		// "0.999": "เก้าสิบเก้าสตางค์",   // rounds down
		// "1.005": "หนึ่งบาทหนึ่งสตางค์", // rounds up

		// Baht + Satang
		"1.01":   "หนึ่งบาทหนึ่งสตางค์",
		"11.10":  "สิบเอ็ดบาทสิบสตางค์",
		"99.99":  "เก้าสิบเก้าบาทเก้าสิบเก้าสตางค์",
		"123.01": "หนึ่งร้อยยี่สิบสามบาทหนึ่งสตางค์",

		// Integer only
		"1":    "หนึ่งบาทถ้วน",
		"10":   "สิบบาทถ้วน",
		"11":   "สิบเอ็ดบาทถ้วน",
		"21":   "ยี่สิบเอ็ดบาทถ้วน",
		"101":  "หนึ่งร้อยหนึ่งบาทถ้วน",
		"1001": "หนึ่งพันหนึ่งบาทถ้วน",
		"2001": "สองพันหนึ่งบาทถ้วน",

		// Large numbers
		"123456":        "หนึ่งแสนสองหมื่นสามพันสี่ร้อยห้าสิบหกบาทถ้วน",
		"1000000":       "หนึ่งล้านบาทถ้วน",
		"2000000":       "สองล้านบาทถ้วน",
		"2100000":       "สองล้านหนึ่งแสนบาทถ้วน",
		"123456789":     "หนึ่งร้อยยี่สิบสามล้านสี่แสนห้าหมื่นหกพันเจ็ดร้อยแปดสิบเก้าบาทถ้วน",
		"123456789.50":  "หนึ่งร้อยยี่สิบสามล้านสี่แสนห้าหมื่นหกพันเจ็ดร้อยแปดสิบเก้าบาทห้าสิบสตางค์",
		"1000000000":    "หนึ่งพันล้านบาทถ้วน",
		"1000000000000": "หนึ่งล้านล้านบาทถ้วน",
		"9000000000000": "เก้าล้านล้านบาทถ้วน",
	}

	for input, expected := range tests {
		val, err := decimal.NewFromString(input)
		if err != nil {
			t.Errorf("error parsing input %q: %v", input, err)
			continue
		}

		output, err := utils.DecimalToBahtText(val)
		if err != nil {
			t.Errorf("DecimalToBahtText(%q) returned error: %v", input, err)
			continue
		}

		if output != expected {
			t.Errorf("DecimalToBahtText(%q) = %q; want %q", input, output, expected)
		}
	}
}
